tap "homebrew/cask", "git@github.com:homebrew/homebrew-cask"
tap "homebrew/cask-fonts", "git@github.com:homebrew/homebrew-cask-fonts"
tap "homebrew/cask-versions", "git@github.com:homebrew/homebrew-cask-versions"
tap "homebrew/cask-drivers", "git@github.com:homebrew/homebrew-cask-drivers"
tap "adoptopenjdk/openjdk", "git@github.com:adoptopenjdk/openjdk"

brew "gnu-sed"
brew "direnv"
brew "docker"
brew "docker-machine"
brew "exa"
brew "git"
brew "jq"
brew "jsonlint"
brew "wget"
brew "nvm"
brew "fswatch"
brew "ripgrep"
brew "bat"
brew "zoxide"
brew "fzf"
brew "gitui"
brew "git-delta"
brew "netnewswire"

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

cask "alfred"
cask "appcleaner"
cask "iTerm2"
cask "keepassxc"
cask "spotify"
cask "visual-studio-code"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "rectangle"
cask "the-unarchiver"
cask "fork"

# fonts
## development
cask "font-fira-code"
cask "font-firacode-nerd-font-mono"
cask "font-meslo-lg-nerd-font"
## websites (?)
cask "font-lato"
cask "font-raleway"
