tap "homebrew/cask", "git@github.com:homebrew/homebrew-cask"
tap "homebrew/cask-fonts", "git@github.com:homebrew/homebrew-cask-fonts"
tap "homebrew/cask-versions", "git@github.com:homebrew/homebrew-cask-versions"
# yubico
tap "homebrew/cask-drivers", "git@github.com:homebrew/homebrew-cask-drivers"
# sketchybar
tap "FelixKratz/formulae", "git@github.com:FelixKratz/homebrew-formulae.git"

brew "bat"
brew "direnv"
brew "docker"
brew "exa"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "graphviz"
brew "helm"
brew "htop"
brew "jq"
brew "jsonlint"
brew "kubernetes-cli"
brew "nvm"
brew "ripgrep"
brew "sketchybar"
brew "tree"
brew "wget"
brew "zoxide"

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

cask "appcleaner"
cask "bitwarden"
cask "figma"
cask "fork"
cask "iTerm2"
cask "raycast"
cask "signal"
cask "the-unarchiver"
cask "visual-studio-code"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"

# fonts
## development
cask "font-fira-code"
cask "font-firacode-nerd-font-mono"
cask "font-meslo-lg-nerd-font"
## websites (?)
cask "font-lato"
cask "font-raleway"
